#+TITLE: Juleøl
#+AUTHOR: Vegard Sjonfjell og Johan Fjeldtvedt
#+DATE: Fredag 30 Oct 2019
#+OPTIONS: toc:nil

** Malt
#+BEGIN_SRC hy :session bjarne :results output table :exports results
      (to-table grains [:name format-grams (percentage :grams)])
#+END_SRC

#+RESULTS:
| Pale malt            | 7930 g | 96.35 % |
| Crisp Chocolate Malt | 100 g  | 1.22 %  |
| Caramel pils malt    | 100 g  | 1.22 %  |
| Flaket havre         | 100 g  | 1.22 %  |

#+BEGIN_SRC hy :session bjarne :results output table :exports results
(get-total grains ':grams)
#+END_SRC

#+RESULTS:
: 8230.310953995715

#+BEGIN_SRC hy :session bjarne :results output table :exports results
      (total-ebc grains)
#+END_SRC

#+RESULTS:
: 15.813686201830757

** Humle
#+BEGIN_SRC hy :session bjarne :results output table :exports results
  (to-table hops [:name format-grams (percentage :grams)])
#+END_SRC
    
#+RESULTS:
| Admiral                  | 71 g  | 24.77 % |
| Nittedal                 | 31 g  | 10.98 % |
| Eienerbær                | 161 g | 56.53 % |
| Lakrisrot                | 22 g  | 7.72 %  |
| Kanelbark (2 cm, knuses) | 0 g   | 0.00 %  |
| Nellikspiker (2 stk)     | 0 g   | 0.00 %  |
    
* Koking
Kok i 60 minutter.
Humle disponeres i kokeapparat på følgende måte.
   
#+BEGIN_SRC hy :session bjarne :results output table :exports results
      (to-table hops [:name format-time format-grams])
#+END_SRC

#+RESULTS:
| Admiral                  | 60 min | 71 g  |
| Nittedal                 | 15 min | 31 g  |
| Eienerbær                | 15 min | 161 g |
| Lakrisrot                | 15 min | 22 g  |
| Kanelbark (2 cm, knuses) | 15 min | 0 g   |
| Nellikspiker (2 stk)     | 15 min | 0 g   |

#+BEGIN_SRC hy :session bjarne :results output table :exports results
(get-total hops ':grams)
#+END_SRC

#+RESULTS:
: 284.79774157292576
   
